#+TITLE: Tema 2: Fundamentos de C
#+DATE:
#+STARTUP: beamer
#+SETUPFILE: config.org
#+PROPERTY: header-args :tangle code/02-fundamentos.c :comments org
#+OPTIONS: H:3

*** Definición con =int=

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // int designa variable de números enteros
  int dia;
  // Asignamos un valor a la variable dia
  dia = 6;
  printf("Hoy es día %i\n", dia);
  return 0;
}
#+END_SRC

#+RESULTS:
: Hoy es día 6

*** Definición y asignación
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // Hacemos la asignación junto con la definición
  int dia = 6;
  printf("Hoy es día %i\n", dia);
  return 0;
}
#+END_SRC

#+RESULTS:
: Hoy es día 6

*** Uso de =printf=
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  double num = 102.30;
  // Usamos %f para números reales
  printf("Esto es un número real %f\n", num);
  // Indicamos número de decimales explicitamente
  printf("escrito con dos decimales %.2f\n", num);

  return 0;
}
#+END_SRC

#+RESULTS:
| Esto | es      | un  | número | real      | 102.3 |
| ...  | escrito | con | dos    | decimales | 102.3 |

*** Distintos formatos
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  double num = 103.56e10;
  printf("Esto es un número real %f\n", num);
  printf("... en notación científica %e\n", num);
  printf("... y de forma automática %g\n", num);
  return 0;
}
#+END_SRC

#+RESULTS:
| Esto | es | un       | número     | real         | 1035600000000.0 |
| ...  | en | notación | científica | 1.035600e+12 |                 |
| ...  | y  | de       | forma      | automática   |      1.0356e+12 |

*** Uso de =printf=
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // Usamos %c para caracteres
  // Atención: para delimitar caracteres usamos '
  printf("La última letra del alfabeto es la %c\n", 
	 'z');
  //Usamos %i para enteros
  printf("Su valor en la tabla ASCII es %i\n", 
	 'z');
  //Y si usamos %c para un número?
  printf("El número %i es la letra %c\n", 
	 122, 122);
  return 0;
}
#+END_SRC

#+RESULTS:
| La | última | letra | del | alfabeto | es    | la |   z |
| Su | valor  | en    | la  | tabla    | ASCII | es | 122 |
| El | número | 122   | es  | la       | letra | z  |     |

*** Definición y asignación

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // Usamos char para asignar caracteres
  char letra = 'z';
  printf("La última letra es la %c\n", letra);
  return 0;
}
#+END_SRC

#+RESULTS:
: La última letra es la z

*** Asignación de números a =char= 

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // Y char con un número?
  char letra = 122;
  printf("La última letra es la %c\n", letra);
  return 0;
}
#+END_SRC

#+RESULTS:
: La última letra es la z

*** Definición y asignación

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int dia = 6;
  int anho = 2017;
  // char define una variable de caracteres.  
  // Para una cadena hay que indicar
  // la longitud entre corchetes
  char mes[10] = "febrero";

  printf("Hoy es día %i de %s de %i\n",
	 dia, mes, anho);
  return 0;
}
#+END_SRC

#+RESULTS:
: Hoy es día 6 de noviembre2 de 2017


*** Definición y asignación
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // Las variables del mismo tipo
  // se pueden definir en una misma línea
  int dia = 6, anho = 2017;
  char mes[10] = "febrero";

  printf("Hoy es día %i de %s de %i\n",
	 dia, mes, anho);
  return 0;
}
#+END_SRC

#+RESULTS:
: Hoy es día 6 de febrero de 20172

*** =sizeof=

Proporciona el tamaño de su operando en bytes.

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int i1;
  float f1;
  double d1;
  char c1;

  printf("Un entero ocupa %d bytes\n", sizeof i1);
  printf("Un float ocupa %d bytes\n", sizeof f1);
  printf("Un double ocupa %d bytes\n", sizeof d1);
  printf("Un caracter ocupa %d bytes\n", sizeof c1);

  return 0;
}
#+END_SRC

#+RESULTS:
| Un | entero   | ocupa  |     4 | bytes |       |
| Un | real     | ocupa  |     4 | bytes |       |
| Un | real     | double | ocupa | 8     | bytes |
| Un | caracter | ocupa  |     1 | bytes |       |

*** Aritméticos con enteros
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int x, y, sum;
  x = 10;
  y = 15;
  sum = x + y;

  printf("La suma de %i con %i es %i\n",
	 x, y, sum);
  return 0;
}
#+END_SRC

#+RESULTS:
: La suma de 10 con 15 es 25


*** Aritméticos con caracteres
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  char letra, Letra;
  letra = 'z';
  Letra = letra - 32;

  printf("La letra %c en mayúscula es %c\n",
	 letra, Letra);
  return 0;
}
#+END_SRC

#+RESULTS:
: La letra z en mayúscula es Z

*** Conversión implícita
- Asignaciones :: el valor de la derecha se convierte al tipo de la variable de la izquierda (posible aviso o error).
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  float f1 = 3.7, f2;
  int i1 = 2, i2;
  // Real a entero: pierde decimales
  i2 = f1;
  printf("Un real %f convertido a entero %d\n", 
	 f1, i2);
  // Entero a real: no cambia valor
  f2 = i1;
  printf("Un entero %d convertido a real %f\n",
	 i1, f2);
  return 0;
}
#+END_SRC

#+RESULTS:
| Un | real   | 3.7 | convertido | a | entero |   3 |
| Un | entero |   2 | convertido | a | real   | 2.0 |



*** Conversión explícita
- Conversión explícita o forzada :: =(tipo) expresión=
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  float f1 = 3.7, f2;
  int i1 = 2, i2;

  f2 = (float) i1;
  printf("Un entero %d convertido a real %f\n",
	 i1, f2);

  i2 = (int) f1;
  printf("Un real %f convertido a entero %d\n",
	 f1, i2);
  return 0;
}
#+END_SRC

#+RESULTS:
| Un | entero |   2 | convertido | a | real   | 2.0 |
| Un | real   | 3.7 | convertido | a | entero |   3 |

*** Conversión en expresiones
- Expresiones :: los valores de los operandos se convierten al tipo del operando que tenga la precisión más alta.

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  double f1 = 100;
  int i1 = 150, i2 = 100;
  printf("Un entero, %d, dividido por un real, %f,",
	 i1, f1);
  printf(" produce un real, %f\n",
	 i1 / f1);
  printf("Un entero, %d, por un entero, %d: %d\n",
	 i1, i2, i1 / i2);
  return 0;
}
#+END_SRC

#+RESULTS:
| Un entero | 150 | dividido por un real |  100.0 | produce un real | 1.5 |
| Un entero | 150 | por un entero        | 100: 1 |                 |     |


